Revit 2027 API
BuiltInFailures.RebarShapeFailures.HooksAndEndTreatmentAtTheSameEnd Property
 Cannot add hooks and end treatments at the same end.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId HooksAndEndTreatmentAtTheSameEnd { get; }
Public Shared ReadOnly Property HooksAndEndTreatmentAtTheSameEnd As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ HooksAndEndTreatmentAtTheSameEnd {
	FailureDefinitionId^ get ();
}
static member HooksAndEndTreatmentAtTheSameEnd : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RebarShapeFailures Class
Autodesk.Revit.DB Namespace